{
    "1": "0 ",
    "2": "1 ",
    "3": "2 ",
    "4": "3 ",
    "5": "4 ",
    "6": "5 ",
    "7": "6 ",
    "8": "7 ",
    "9": "8 ",
    "10": "9 ",
    "11": "(0, 0) ",
    "12": "(0, 1) ",
    "13": "(0, 2) ",
    "14": "(0, 3) ",
    "15": "(0, 4) ",
    "16": "(0, 5) ",
    "17": "(0, 6) ",
    "18": "(0, 7) ",
    "19": "(0, 8) ",
    "20": "(1, 0) ",
    "21": "(1, 1) ",
    "22": "(1, 2) ",
    "23": "(1, 3) ",
    "24": "(1, 4) ",
    "25": "(1, 5) ",
    "26": "(1, 6) ",
    "27": "(1, 7) ",
    "28": "(1, 8) ",
    "29": "(2, 0) ",
    "30": "(2, 1) ",
    "31": "(2, 2) ",
    "32": "(2, 3) ",
    "33": "(2, 4) ",
    "34": "(2, 5) ",
    "35": "(2, 6) ",
    "36": "(2, 7) ",
    "37": "(2, 8) ",
    "38": "(3, 0) ",
    "39": "(3, 1) ",
    "40": "(3, 2) ",
    "41": "(3, 3) ",
    "42": "(3, 4) ",
    "43": "(3, 5) ",
    "44": "(3, 6) ",
    "45": "(3, 7) ",
    "46": "(3, 8) ",
    "47": "(4, 0) ",
    "48": "(4, 1) ",
    "49": "(4, 2) ",
    "50": "(4, 3) ",
    "51": "(4, 4) ",
    "52": "(4, 5) ",
    "53": "(4, 6) ",
    "54": "(4, 7) ",
    "55": "(4, 8) ",
    "56": "(5, 0) ",
    "57": "(5, 1) ",
    "58": "(5, 2) ",
    "59": "(5, 3) ",
    "60": "(5, 4) ",
    "61": "(5, 5) ",
    "62": "(5, 6) ",
    "63": "(5, 7) ",
    "64": "(5, 8) ",
    "65": "(6, 0) ",
    "66": "(6, 1) ",
    "67": "(6, 2) ",
    "68": "(6, 3) ",
    "69": "(6, 4) ",
    "70": "(6, 5) ",
    "71": "(6, 6) ",
    "72": "(6, 7) ",
    "73": "(6, 8) ",
    "74": "(7, 0) ",
    "75": "(7, 1) ",
    "76": "(7, 2) ",
    "77": "(7, 3) ",
    "78": "(7, 4) ",
    "79": "(7, 5) ",
    "80": "(7, 6) ",
    "81": "(7, 7) ",
    "82": "(7, 8) ",
    "83": "(8, 0) ",
    "84": "(8, 1) ",
    "85": "(8, 2) ",
    "86": "(8, 3) ",
    "87": "(8, 4) ",
    "88": "(8, 5) ",
    "89": "(8, 6) ",
    "90": "(8, 7) ",
    "91": "(8, 8) ",
    "92": "#1, ",
    "93": "#2, ",
    "94": "#3, ",
    "95": "#4, ",
    "96": "#5, ",
    "97": "#6, ",
    "98": "#7, ",
    "99": "#8, ",
    "100": "#9, ",
    "101": "- ",
    "102": "<input>\n",
    "103": "</input>\n\n",
    "104": "<output>\n",
    "105": "</output>\n\n",
    "106": "<reasoning>\n",
    "107": "</reasoning>\n\n",
    "108": "<board>\n",
    "109": "</board>\n",
    "110": "<stack>\n",
    "111": "\n</stack>\n",
    "112": "<fill number>\n",
    "113": "</fill number>\n",
    "114": "=> Number of possibilities (estimate): ",
    "115": "[Sudoku is solved]\n",
    "116": "[Sudoku is not solved]\n",
    "117": "=> Minimum estimated value: ",
    "118": "=> Impossible values in row: ",
    "119": "=> Impossible values in column: ",
    "120": "=> Impossible values in box: ",
    "121": "=> All impossible values: ",
    "122": "=> All possible values: ",
    "123": "[No possible value exists]\n",
    "124": "[Possible value exists]\n",
    "125": "> Fill cell ",
    "126": "[update stack]\n",
    "127": "=> Possible values: ",
    "128": "[No possible value exists, reset cell]",
    "129": "None",
    "130": "=> Remaining possible values: ",
    "131": "=> Backtracking, pop from stack: ",
    "132": "\n"
}